In [1]:
import numpy as np
import pandas as pd

In [2]:
lista1 = ['a', 'b', 'c'] # lista de strings
lista2 = [1, 2, 3] # lista de inteiros
arr = np.array([10, 20, 30]) # array numpy
d = {'a': 100, 'b': 200, 'c': 300} # dicionário

In [3]:
pd.Series(data = lista2, index = lista1) # cria uma série a partir de listas

a    1
b    2
c    3
dtype: int64

In [4]:
pd.Series(lista2,lista1) # cria uma série a partir de listas

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(arr) # cria uma série a partir de um array numpy

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(arr, lista1) # cria uma série a partir de um array numpy e uma lista

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d) # cria uma série a partir de um dicionário

a    100
b    200
c    300
dtype: int64

INDICES

In [8]:
serie1 = pd.Series([1,2,3,4], index = ['EUA', 'Alemanha', 'URSS', 'Japão'])

In [9]:
serie1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [10]:
serie2 = pd.Series([5,6,7,8], index = ['Azul', 'Verde', 'Amarelo', 'Vermelho'])

In [11]:
serie2

Azul        5
Verde       6
Amarelo     7
Vermelho    8
dtype: int64

In [12]:
serie1['EUA']

1

In [13]:
serie2['Azul']

5

In [14]:
serie1 + serie2

Alemanha   NaN
Amarelo    NaN
Azul       NaN
EUA        NaN
Japão      NaN
URSS       NaN
Verde      NaN
Vermelho   NaN
dtype: float64

> Note que as somas sairam todos com NaN, pq nenhum indice é repetido, portanto ele não soma a série.

In [15]:
serie3 = pd.Series([5,6,7,8], index = ['EUA', 'Alemanha', 'Itália', 'Japão'])

In [16]:
serie3

EUA         5
Alemanha    6
Itália      7
Japão       8
dtype: int64

In [17]:
serie1 + serie3

Alemanha     8.0
EUA          6.0
Itália       NaN
Japão       12.0
URSS         NaN
dtype: float64

> Aqui já é o contrário, pois o indice Alemanha, EUA e Japão se repetem tanto na serie1 quanto na serie3. Portanto, a soma acontece com as séries onde os indices se repetem.

DATAFRAMES

In [18]:
np.random.seed(101) # para garantir que os números aleatórios sejam sempre os mesmos

In [19]:
#df = pd.DataFrame(dados, nome_linhas, nome_colunas) # cria um DataFrame a partir de um dicionário

In [20]:
df = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

# 'A B C D E'.split() é o mesmo que ['A', 'B', 'C', 'D', 'E']

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

SELECAO E INDEXACAO

In [22]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [24]:
df.X # ou df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df['Novo'] = df['W'] - df['X']

In [27]:
df

          W         X         Y         Z      Novo
A  2.706850  0.628133  0.907969  0.503826  2.078717
B  0.651118 -0.319318 -0.848077  0.605965  0.970436
C -2.018168  0.740122  0.528813 -0.589001 -2.758290
D  0.188695 -0.758872 -0.933237  0.955057  0.947567
E  0.190794  1.978757  2.605967  0.683509 -1.787963

In [28]:
df.drop(['Novo'], axis = 1, inplace=True) # remove a coluna 'Novo', axis = 1 indica que é uma coluna, se fosse linha seria axis = 0

In [29]:
df # a coluna 'Novo' não foi removida do DataFrame, permanece inalterado, portanto, inplace = True  é  necessário para que a alteração seja permanente.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
# Poderiamos também usar df = df.drop(['Novo'], axis = 1) para que a alteração seja permanente.

In [31]:
df.drop('E', axis = 0) # remove a linha 'E'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
df.loc['A'] # retorna a linha 'A'

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [33]:
df.loc[['A', 'B']] # retorna as linhas 'A' e 'B'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [34]:
df.iloc[0] # retorna a linha 0, que é a linha 'A'

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [35]:
df.loc['B', 'Y'] # retorna o valor da linha 'B' e coluna 'Y'

-0.8480769834036315

In [36]:
df.loc[['A', 'B'], ['W', 'Y']] # retorna as linhas 'A' e 'B' e as colunas 'W' e 'Y'

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

SELECAO CONDICIONAL

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df > 0 # retorna um DataFrame com valores booleanos

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [39]:
df[df > 0] # retorna um DataFrame com valores positivos e NaN para valores negativos ou zero

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df[df['W'] > 0] # retorna um DataFrame com valores positivos na coluna 'W'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df[(df['W'] > 0 ) & (df['X'] > 1)] # retorna um DataFrame com valores positivos nas colunas 'W' e 'Y', sendo o valor de 'Y' maior que 1 e 'W' maior que 0. Isso é feito com o operador &, que é o operador lógico 'E'

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

DADOS AUSENTES

In [42]:
df = pd.DataFrame({'A':[10,20,np.nan],
                   'B':[40, np.nan, np.nan],
                   'C':[70,80,90]}) # cria um DataFrame a partir de um dicionário, np.nan é um valor nulo. O dicionário é composto por listas de valores.

In [43]:
df

      A     B   C
0  10.0  40.0  70
1  20.0   NaN  80
2   NaN   NaN  90

In [44]:
df.dropna(axis = 1) # remove todas as linhas que contém NaN. Axis = 1 indica que é uma coluna, se fosse linha seria axis = 0

    C
0  70
1  80
2  90

In [45]:
df.dropna(axis = 0) # remove todas as colunas que contém NaN. Axis = 0 indica que é uma linha, se fosse coluna seria axis = 1

      A     B   C
0  10.0  40.0  70

In [46]:
df.dropna(thresh = 2) # remove as linhas que contém pelo menos 2 valores NaN

      A     B   C
0  10.0  40.0  70
1  20.0   NaN  80

In [47]:
df.fillna(value = 0) # preenche os valores NaN com 0, poderia ser qualquer outro valor, incluindo strings e outros tipos de dados. geralmente é usado a média dos valores da coluna.

      A     B   C
0  10.0  40.0  70
1  20.0   0.0  80
2   0.0   0.0  90

In [48]:
df['A'].fillna(value = df['A'].mean()) # preenche os valores NaN da coluna 'A' com a média dos valores da coluna 'A'. fillna não é um método inplace, portanto, a alteração não é permanente.

0    10.0
1    20.0
2    15.0
Name: A, dtype: float64

GROUPBY

In [49]:
dados = {'Setor':['Frutas', 'Frutas', 'Bebidas', 'Bebidas', 'Carnes', 'Carnes'],
         'Vendedores':['Aline', 'Carlos', 'Aline', 'Joao', 'Flavia', 'Joao'],
         'Venda': [100, 200, 300, 400, 500, 600]}

In [50]:
df = pd.DataFrame(dados)

In [51]:
df

     Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600

In [52]:
df.groupby('Setor') # agrupa os dados por setor, porém na saída é mostrado apenas o endereço de memória do objeto. Então para ver os dados é necessário usar uma função de agregação. Como por exemplo a função sum() ou mean().

In [53]:
df.groupby('Setor').sum() # soma as vendas por setor

          Vendedores  Venda
Setor
Bebidas    AlineJoao    700
Carnes    FlaviaJoao   1100
Frutas   AlineCarlos    300

In [54]:
df.groupby('Setor').min() # retorna o menor valor de venda por setor

        Vendedores  Venda
Setor
Bebidas      Aline    300
Carnes      Flavia    500
Frutas       Aline    100

In [55]:
setor = df.groupby('Setor') # cria um objeto do tipo DataFrameGroupBy

In [56]:
setor.min() # retorna o menor valor de venda por setor

        Vendedores  Venda
Setor
Bebidas      Aline    300
Carnes      Flavia    500
Frutas       Aline    100

In [60]:
setor.dtypes # retorna o tipo de dados de cada coluna

C:\Users\caiqu\AppData\Local\Temp\ipykernel_3168\2917126805.py:1: FutureWarning: DataFrameGroupBy.dtypes is deprecated and will be removed in a future version. Check the dtypes on the base object instead
  setor.dtypes # retorna o tipo de dados de cada coluna

          Setor Vendedores  Venda
Setor
Bebidas  object     object  int64
Carnes   object     object  int64
Frutas   object     object  int64

In [61]:
setor.describe() # retorna um resumo estatístico dos dados

        Venda
        count   mean        std    min    25%    50%    75%    max
Setor
Bebidas   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Carnes    2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Frutas    2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

In [63]:
setor.mean('Venda') # retorna a média das vendas por setor. Lembrando que o método mean() é uma função de agregação de numeros, portanto, caso a coluna 'Venda' não seja numérica, o método mean() não funcionará. E no nosso caso, setor é um objeto do tipo DataFrameGroupBy, portanto, não é possível usar o método mean() diretamente.

         Venda
Setor
Bebidas  350.0
Carnes   550.0
Frutas   150.0

> O professor segue na aula ensinando sobre *setor.std()*, porém nesse caso, std() não aceita valores não núméricos, como o *setor = df.groupby('Setor')*. Perceba que o setor recebe "Setor" como um parametro, mas os dados incluido nessa coluna são todos string. Pra resolver esse problema tive que recorrer ao chatGPT, e pedir por uma ajuda.

In [69]:
setor = df.groupby('Setor')
group_std = setor['Venda'].std()  # Aplica o desvio padrão apenas na coluna 'Vendas'

In [70]:
group_std

Setor
Bebidas    70.710678
Carnes     70.710678
Frutas     70.710678
Name: Venda, dtype: float64

>É o mais proximo que eu consegui fazer do exemplo do professor, acredito que ele por estar usando uma versão diferente do python que eu estou usando, e talvez por estar usando o Jupyter, no vídeo deu certo, utilizando o metodo setor.std()

In [71]:
setor.max() # retorna o maior valor de venda por setor

        Vendedores  Venda
Setor
Bebidas       Joao    400
Carnes        Joao    600
Frutas      Carlos    200

In [72]:
setor.count() # retorna a quantidade de vendas por setor

         Vendedores  Venda
Setor
Bebidas           2      2
Carnes            2      2
Frutas            2      2

In [74]:
sum(df['Venda']) # retorna a soma das vendas por setor

2100

In [75]:
df.info() # retorna informações sobre o DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Setor       6 non-null      object
 1   Vendedores  6 non-null      object
 2   Venda       6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [76]:
df

     Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600

In [77]:
df.head() # retorna as primeiras linhas do DataFrame

     Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500

In [78]:
df.tail() # retorna as últimas linhas do DataFrame

     Setor Vendedores  Venda
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600

In [79]:
df.describe() # retorna um resumo estatístico do DataFrame

            Venda
count    6.000000
mean   350.000000
std    187.082869
min    100.000000
25%    225.000000
50%    350.000000
75%    475.000000
max    600.000000